// !===================================== модуль 1 Дз 1
//* Объявление переменных
//? <ключевое слово> <имя переменной> = <значение>
// const productName = 'Droid';
// const pricePerItem = 2000;
// console.log(productName); // 'Droid'

// console.log(pricePerItem); // 2000

// !===================================== модуль 1 Дз 2
//* Переопределение значения переменной

// let productName = 'Droid';
// productName = 'Repair droid';

// let pricePerItem = 2000;
// pricePerItem = 2000 + 1500; //3500
// console.log(productName); // 'Repair droid'

// console.log(pricePerItem); // 3500

// !===================================== модуль 1 Дз 3
//* Типы примитивов (числа, строки, були)
//? Number - целые числа и числа с плавающей запятой (точкой).
//? String - строки, последовательность из нуля или более символов. Строка начинается и заканчивается одиночной ' или двойными кавычками ".
//? Boolean - логический тип данных, флаги состояния. Всего два значения: true и false. Например, на вопрос включен ли свет в комнате можно ответить да (true) или нет (false).
// let topSpeed = 160; //Number
// const distance = 617.54; //Number

// const login = 'mango935'; //String

// let isOnline = true; //Boolean
// const isAdmin = false; //Boolean

// console.log(topSpeed);
// console.log(distance);
// console.log(login);
// console.log(isOnline);
// console.log(isAdmin);

// !===================================== модуль 1 Дз 4
//* Математические операторы
// const pricePerItem = 3500;
// const orderedQuantity = 4;

// const totalPrice = pricePerItem * orderedQuantity;
// console.log(totalPrice); //14000

// !===================================== модуль 1 Дз 5
//* Шаблонные строки ``
// const productName = 'Droid';
// const pricePerItem = 3500;

// const message = `You picked ${productName}, price per item is ${pricePerItem} credits`;
// console.log(message); // "You picked Droid, price per item is 3500 credits"

// !===================================== модуль 1 Дз 6
//* Задача: заказ продукта
// const pricePerDroid = 800;
// const orderedQuantity = 6;
// const deliveryFee = 50;

// let totalPrice = pricePerDroid * orderedQuantity + deliveryFee; // 4850
// const message = `You ordered droids worth ${totalPrice} credits. Delivery (${deliveryFee} credits) is included in total price.`;

// console.log(totalPrice);
// console.log(message);

// !===================================== модуль 1 Дз 7
//* Объявление и вызов функции
//? function multiply() {} - объявление
//? () - вызов
//? { } - тело

function sayHi() {
  console.log('Hello, this is my first function!');
}
sayHi();

// !===================================== модуль 1 Дз 8
// !===================================== модуль 1 Дз 9
// !===================================== модуль 1 Дз 10
// !===================================== модуль 1 Дз 11
// !===================================== модуль 1 Дз 12
// !===================================== модуль 1 Дз 13
// !===================================== модуль 1 Дз 14
// !===================================== модуль 1 Дз 15
// !===================================== модуль 1 Дз 16
// !===================================== модуль 1 Дз 17
// !===================================== модуль 1 Дз 18
// !===================================== модуль 1 Дз 19
// !===================================== модуль 1 Дз 20
// !===================================== модуль 1 Дз 21
// !===================================== модуль 1 Дз 22
// !===================================== модуль 1 Дз 23
// !===================================== модуль 1 Дз 24
// !===================================== модуль 1 Дз 25
// !===================================== модуль 1 Дз 26
// !===================================== модуль 1 Дз 27
// !===================================== модуль 1 Дз 28
// !===================================== модуль 1 Дз 29
